["1U: Recognize that precise instructions are more likely to produce the intended result (as compared to more general ones).", "1A: Give an example of how general instructions could produce something other than the intended outcome.", "3.1U: Understand how to break down a task into steps in advance (instead of while a task is being done) to create a set of complete, precise instructions.", "3.1A: Articulate set of steps (not necessarily ordered) that achieves an intended outcome.", "3.2U: Understand how to create effective sets of instructions from only a limited set of options.", "3.2A: Choose from a limited set of instructions a valid set to accomplish a particular task.", "4.1U: Understand that computers have a limited vocabulary, so you must be precise and use available commands when giving them directions.", "4.1A: Choose from a given set of commands to create a program that accomplishes a task.", "2U: Understand that there may be several sets of instructions that accomplish the same outcome.", "2A: Explain more than one way to accomplish a goal, or observe alternative approaches and evaluate which are effective.", "3U: Understand that following directions in different orders can lead to different outcomes.", "3A: Given an unordered set of instructions, put them in an order that achieves a particular outcome. Explain how a different outcome could be produced from the same instructions.", "4U: Understand that computers interpret instructions in order, with a start and a finish, and so the order in which they are given to a computer can affect the computer’s output.", "4A: Order a set of blocks to create a program that produces a desired outcome.", "5U: Recognize the importance of putting the correct blocks in the correct sequence.", "5A: Place the correct blocks in the correct sequence to achieve a desired outcome.", "6U: Understand how some commands (e.g. conditional statements, repeat commands, event handlers) change the default order in which instructions are executed, altering which instructions are executed and when.", "6A: Choose blocks that create the appropriate control flow through a program.", "7U: Understand the ways in which new instructions can be added to sequences of instructions, and how the place in which the new instructions are added may affect the outcome.", "7A: Add instructions within an existing sequence in the appropriate place to achieve the desired outcome.", "8U: Understand that sequencing is a foundational concept used in all computing languages.", "8A: Apply general understanding of sequencing to different programming environments and languages.", "DISCARDED", "Better for variables", "Duplicated within trajectory", "Decomposition", "Specific to Alice and gaming"]