["0U: Understand that many actions are effects prompted by specific causes.", "0A: Identify and describe examples of actions and their causes (\"cause and effect\").", "1U: Understand that a condition is a statement that can be classified as true or false.", "1A: Assess the truth-value of a condition.", "1.1U: Understand that a Boolean is a variable with values T or F.", "1.1A: Use a Boolean variable.", "1.2U: Understand when and why to simultaneously consider multiple conditions.", "1.2A: List all the conditions that you might need to consider when solving a particular problem.", "2U: Understand that a conditional is a statement that connects a condition to a corresponding consequence or outcome.", "2A: Create and interpret simple if-then statements as examples of conditionals.", "4.1U: Understand that sometimes conditions overlap, and when and how to consider overlapping conditions.", "4.1A: Identify examples of overlapping conditions. Create and interpret conditionals that consider how conditions overlap.", "3U: Understand when and why it is necessary to specify an outcome to correspond with BOTH states of a condition (true and false).", "3A: Consider both states of a condition when creating conditional statements.", "5U: Understand when and why to use commands such as if-then, if-then-else, and event handlers to signal a computer to evaluate conditions and decide how to act based on conditions.", "5A: Create a program with conditionals.", "6U: Understand when and why to use conditional operations (AND/OR) to express compound conditions.", "6A: Use conditional operators to create compound conditions in conditional statements.", "4U: Understand that computers require all actions to be specified, and that you have to create a conditional to prompt a computer to complete each action.", "4A: Make a complete list of the required actions and their associated conditions, and create the necessary conditionals.", "7U: Understand conditional branching, that is, understand the reach of the effects of a conditional statement and how conditionals can affect the path of execution.", "7A: Create different pathways in programs using conditional statements.", "8U: Understand when and why to create complex conditionals using multiple, nested, or complex conditions or conditional statements.", "8A: Combine conditions using nesting or other techniques to accomplish complex goals.", "9U: Understand how to evaluate and apply different approaches to combining conditional statements for particular problem.", "9A: Implement an appropriate approach to using conditionals to achieve the desired program behavior.", "9.1U: Understand that different programming/ computing environments have different features/looks/input. Recognize that conditionals can be performed by any of these.", "9.1A: Apply general understanding of conditionals to different programming environments and languages."]